In [ ]:
import sqlite3
import pandas as pd

<img src='joins.png'>

In [ ]:
con = sqlite3.connect(':memory:')
cur = con.cursor()

In [ ]:
names = pd.DataFrame(
    {
        'id': [1, 2, 3, 4, 5],
        'name': ['Петр', 'Петр', 'Олег', 'Мария', 'Елена'],
    }
)
surnames = pd.DataFrame(
    {
        'id': [1, 2, 4, 5, 6],
        'surname': ['Иванов', 'Петров', 'Никитина', 'Смирнова', 'Сидорова'],
    }
)

In [ ]:
names.to_sql('names', con, index=False, if_exists='replace')
surnames.to_sql('surnames', con, index=False, if_exists='replace')

In [ ]:
pd.read_sql(
    '''
    SELECT * FROM names
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT * FROM surnames
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT * FROM names n
    join surnames s on n.id = s.id
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT * FROM names 
    join surnames on names.id = surnames.id
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT * FROM names n
    inner join surnames s on n.id = s.id
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT * FROM names n
    left join surnames s on n.id = s.id
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT * FROM names n
    right join surnames s on n.id = s.id
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.*,s.* FROM surnames s
    left join names n on n.id = s.id
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where n.name = 'Петр'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where n.name != 'Петр'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where n.id >=2
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where s.surname like '%а'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where s.surname like 'И%'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where n.name like 'П_тр'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where n.name = 'Петр' and s.surname = 'Петров'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where n.name = 'Петр' or s.surname = 'Смирнова'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname FROM names n 
    join surnames s on n.id = s.id
    where n.id between 1 and 4
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT distinct n.name FROM names n 
    ''',

    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.name FROM names n 
    join surnames s on n.id = s.id
    where s.surname = 'Иванов'
    UNION ALL
    SELECT n.name FROM names n 
    join surnames s on n.id = s.id
    where s.surname = 'Петров'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.name FROM names n 
    join surnames s on n.id = s.id
    where s.surname = 'Иванов'
    UNION
    SELECT n.name FROM names n 
    join surnames s on n.id = s.id
    where s.surname = 'Петров'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.name,n.id FROM names n 
    join surnames s on n.id = s.id
    where s.surname = 'Иванов'
    UNION
    SELECT n.name,n.id FROM names n 
    join surnames s on n.id = s.id
    where s.surname = 'Петров'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname , 
    case when s.surname like '%а' then 'female' else 'male' end as 'sex'
    FROM names n 
    join surnames s on n.id = s.id
    ''',
    con,
)

In [ ]:
ages = pd.DataFrame(
    {
        'id': [1, 2, 3, 4, 5, 6],
        'age': [26, 35, 28, 22, 25, 33],
    }
)

In [ ]:
pd.read_sql(
    '''
    SELECT name FROM sqlite_master WHERE type='table'
    ''',
    con,
)

In [ ]:
ages.to_sql('ages', con, index=False, if_exists='replace')

In [ ]:
pd.read_sql(
    '''
    SELECT name FROM sqlite_master WHERE type='table'
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.id, n.name, s.surname, a.age
    FROM names n 
    join surnames s on n.id = s.id
    join ages a on s.id = a.id
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT max(a.age),min(a.age),avg(a.age),sum(a.age),count(a.age)
    FROM names n 
    join surnames s on n.id = s.id
    join ages a on n.id = a.id
    ''',
    con,
)

In [ ]:
pd.read_sql(
    '''
    SELECT n.name, max(a.age),min(a.age),avg(a.age),sum(a.age),count(a.age)
    FROM names n 
    join surnames s on n.id = s.id
    join ages a on n.id = a.id
    group by n.name
    ''',
    con,
)